app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:id])
---
SELECT * FROM `students` WHERE (`students`.`id` = 1)

  def create
    session[:student_params] = params[:student]
    @student = Student.new(params[:student])
      if @student.name.blank? || (@student.email.blank? && @student.phone.blank?)
        flash[:error] = '<div style="text-align:center;font-weight:bold;"><p>Please enter your first name and an email address or a phone number, so I can contact you.  Thanks!</p></div>'
      elsif @student.save
---
INSERT INTO `students` (`name`, `updated_at`, `level`, `phone`, `hourly_rate`, `email`, `created_at`) VALUES('asdf', '2009-07-01 02:48:52', NULL, 'asfd', NULL, '', '2009-07-01 02:48:52')